app/views/home/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
                <%@posts.each do |post|%>
                <%user=User.find_by(id:post.user_id)%>