app/controllers/post_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "プログラミング仲間募集中\r\n当方大学生、休学中引きこもり"], ["user_id", 1], ["created_at", "2019-10-02 18:19:46.117611"], ["updated_at", "2019-10-02 18:19:46.117611"]]
---
    def create
        @post=Post.new(content:params[:content],
                       user_id:session[:user_id],)
        @post.save