app/controllers/user_controller.rb

    def detail
        @user=User.find_by(id:params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @user=User.new(email:params[:email],
                       name:params[:name],
                       password:params[:password],
                       image:"user-shape.png")
        @user.save
---
INSERT INTO "users" ("name", "email", "image", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?)

    def update
        @user=User.find_by(id:params[:id])
        @user.self_intro=params[:self_intro]
        @user.image="#{@user.id}.jpg"
        image=params[:image]
        if image
            File.binwrite("public/#{@user.image}",image.read)
        end
        @user.age=params[:age]
        @user.contact=params[:contact]
        @user.sex=params[:sex]
        @user.hobby=params[:hobby]
        @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "self_intro" = ?, "age" = ?, "contact" = ?, "sex" = ?, "hobby" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["self_intro", ""], ["age", 19], ["contact", ""], ["sex", ""], ["hobby", ""], ["updated_at", "2019-10-03 15:02:28.311393"], ["id", 4]]